

const dbdata_str = `[

{"title":"午后奶茶","colors":["#EDE387","#EDEDED","#3B200C","#DE8100","#CCFC62"],"desc":"悠闲的午休"},
{"title":"海与天的边界","colors":["#4cb4e7","#ffc09f","#ffee93","#e2dbbe","#a3a380"],"desc":"这个配色中海蓝色是毫无疑问的中心色彩，而其他几种辅助色彩相对纯度较低，然而在亮度上却不暗淡，这样整体高明度的组合能令人心情轻松，产生无压力的感觉，接触多了也会产生轻浮的感觉。主要适用于生活风格的设计中。"},
{"title":"盛开的桃花","colors":["#9DD3FA","#1F6FB5","#FCD692","#FAFFEB","#FFFFFF"],"desc":"梵高-《盛开的桃花》，蓝天下淡淡的粉色桃花盛开，带着一种静谧和清新，还有对故人的思念。"},
{"title":"晚霞剪影","colors":["#B85A9A","#9C2189","#9E026D","#B8288A","#CC2F69"],"desc":"CC2F69"},
{"title":"美好时代的回忆","colors":["#E03636","#EDD0BE","#25C6FC"],"desc":"橘红色在设计中十分突出，但很少大面积使用，这种色彩用于表现激烈的主题稍显力度不足，没有近亲橙色或红色来的直接，但是在和湖蓝搭配中却很好的发挥了它这种特点，作为暖色大量使用却并不喧宾夺主，很好突出了湖蓝的的特点。"},
{"title":"神奈川冲浪里","colors":["#0D1740","#16245C","#F8F2DC","#A39F93","#E9CFAE"],"desc":"E9CFAE"},
{"title":"森林之光","colors":["#82A6F5","#EAF048","#9FF048","#2A5200","#F6D6FF"],"desc":"阳光下，蓝天白云，草木茂盛。"},
{"title":"洋葱花","colors":["#EACF02","#6C890B","#ABC327","#DFB5B7","#7F1874"],"desc":"绿色和黄色是一对常见的色彩，这两种色彩组成的黄绿色不但在自然界常见，在人类生活中也十分常用，在这里和这两种色彩进行搭配的是红紫色，这种色彩常用于象征女性，纯度不高是为了让绿色和红色这两种对比较强色彩之间形成平衡。"},
{"title":"艺术之旅","colors":["#DB9019","#5ED5D1","#1A2D27","#FF6E97","#F1AAA6"],"desc":"这个配色类型日本传统搭配中较为鲜艳的风格，但实际其更多的用于现代艺术品的着色中。一些画作，图案设计中较为多见，洋红色和黑色的搭配具有十分明显的现代风格，加上现代感十足的湖蓝，整个搭配使用的色彩纯度极高而明度也很高。<br/>"},
{"title":"粉黛红颜","colors":["#AAB8A3","#EBEDF4","#FF5983","#C1194E","#7A023C"],"desc":"虽然作为男生，但不能否认浓烈的洋红色的确吸引眼球，这个特别出彩的颜色搭配上纯度不高的灰绿产生了极大的对比，这里我们要特别说明下这种灰绿在服装设计上使用十分广泛，常常用于一些休闲，家用的相关设计上，在和洋红的搭配中很好的起到了一个陪衬的作用。"},
{"title":"玫瑰金","colors":["#FFEBCC","#FFB86C","#F01B2D","#869B74"],"desc":"在整个搭配中一般红色都是非常具有亮点的，但在这里，黄色却是画面中的主体，在和其他色彩的具有特别高的亮度，而红色和青色作为辅助色，和黄色之间形成了较大的明暗对比。"},
{"title":"夏日的热吻","colors":["#8F1D78","#BA874C","#E9AE6A","#FEE388","#FFFEA0"],"desc":"把这个配色加上夏天的标签看起来并不合适，明亮的黄色和褐色虽然作为暖色，但不会给人热烈的感觉，而紫色更是显得含蓄了些，这个黄色和紫色的组合很好的利用了两种色彩的明暗对比，也通过相同的冷暖关系统一起来，用色不多而产生了不错的效果。"},
{"title":"蓝色的继续","colors":["#011935","#00343F","#1DB0B8","#37C6C0","#D0E9FF"],"desc":"无论在什么情况下，蓝色总是能找到发挥自己特色的地方，即使大面积的蓝色也不太会产生枯燥的感觉，这里采用了改变纯度和明度的手法，来让画面显得变得生动，使得即使少量色彩，依然能给人丰富多彩的感觉。"},
{"title":"森林人","colors":["#E08031","#C7CEB2","#199475","#0B6E48","#044D22"],"desc":"这里使用的绿色并鲜艳，如果单独大面积使用会给人沉闷的感觉，这种绿色的纯度并不高，明度也很一般，在搭配土黄色的时候却很好把这两种较为普通的色彩相互突出来，这个得益于两者之间较大的色相对比，而明亮的青灰则是作为画面中的亮色使用。"},
{"title":"樱花","colors":["#B31800","#EB3F2F"],"desc":"樱花"},
{"title":"白色独角兽","colors":["#EFCEE8","#F3D7B5","#FDFFDF","#DAF9CA","#C7B3E5"],"desc":"优雅的配色一般都会受到女性的喜爱，这个搭配以淡雅的紫色为主，使用了高明度而纯度很低的色彩-这也是构成类似风格搭配的惯用手段，在色调统一的情况下，加入冷暖等对比，依然能统一画面。<br/>"},
{"title":"安静的一天","colors":["#56A36C","#5E8579","#77C34F","#2E68AA","#7E884F"],"desc":"绿色和蓝色等典型的冷色系色彩的组合形成的效果我们不在多讲，相对常规使用的绿和蓝，这里使用色彩纯度更低，明度也相应较低，给人平凡普通的感觉，这种搭配不能在第一时间吸引观者，却十分耐看，因此在生活中也十分常见，如服装，装饰等领域。"},
{"title":"感觉身体被掏空","colors":["#F5F6EB","#EFF0DC","#C9CABB","#34352C"],"desc":"近来总是感觉非常疲倦，来自自身也来自工作，又听到当红神曲，十分被触动，于是就给大家分享这个比较特别的无色系搭配，一般在使用无色系配色的情况下都会使用对比较弱的明暗搭配，而这个则较为特殊，使用接近黑白的高强度搭配，对喜欢使用黑白搭配的朋友来说可能会是另外一种不错的选择。"},
{"title":"落日黄昏","colors":["#FFE957","#F29F3F","#F2753F","#E87E51","#DE8C68"],"desc":"黄昏，以热烈又美丽的姿态迎接黑夜的到来"},


{"title":"即将过去的春天","colors":["#F2FE28","#D2F557","#5AF580","#04DD98","#1CDDB1"],"desc":"黄色和绿色作为常见搭配已经形成了固定的搭配模式了，这个搭配就是这个模式的真是写照，作为一个设计师，并不是说总是需要创造特有的搭配，相反利用好这些常见的配色更是一种本领。"},
{"title":"粉红佳人","colors":["#FFE3FB","#E8FF8C","#FFDEC9","#F5A433","#E6109B"],"desc":"E6109B"},
{"title":"美丽的海洋","colors":["#080D5E","#00034F","#005359","#009FAB","#008891"],"desc":"008891"},
{"title":"峇里夕照","colors":["#C2A47A","#AB4B52","#AB2418","#AB5EA2","#AD8C3D"],"desc":"窗帘配色"},
{"title":"消失的灵魂","colors":["#44615E","#2E3161","#52090B","#948B53","#1A0A4A"],"desc":"1A0A4A"},
{"title":"英伦特色","colors":["#0D1017","#B00404","#003CBD","#FFFFFF"],"desc":"用英国国旗色做配色"},
{"title":"和式蛋糕","colors":["#B3D1C1","#A79496","#DBD9B7","#F1FF2D","#E57B85"],"desc":"宁静的日式风格配色并不是说不能使用高纯度色彩，而是使用其他色彩来平衡高纯度色彩来抢镜，而让整体显得较为稳定，这里使用的常见的日式色彩，如青灰色，偏粉的洋红，所有色彩的使用都与主题相呼应，是类似搭配中上乘之作。"},
{"title":"午夜薰衣草","colors":["#8977b3","#f2f2f2","#041A13","#856C00","#D6D0CE"],"desc":"佩里斯紫色具有鲜明的特点，午夜薰衣草，在夜光下幽幽绽放，暗香浮动，似恋人耳鬓厮磨，浪漫满怀。"},
{"title":"下午茶时间","colors":["#EBF5DF","#BAD4AA","#D4D4AA","#C1A075","#7C6354"],"desc":"对于一个受够都市高强度工作的上班族来说，一段能让人放空心情的悠闲时光是多么难得，这个搭配就是能让人感到轻松，自然的搭配，虽然缺少高强度对比让他不够吸引人们注目，但细细体会，你肯定能发现他的与众不同。"},
{"title":"下雨了","colors":["#DAE3E0","#407D94","#7B7687","#ACADAC","#CCC4C2"],"desc":"CCC4C2"},
{"title":"乘风破浪","colors":["#C7E1F0","#96C4E6","#194D5B","#E560CD","#FAAE4E"],"desc":"大面积的青色在实际使用中会给人清凉干净的视觉感,在和暖色系的洋红和橙色组合的情况下这种特质更加鲜亮,除了这种冷暖对比之外,这几种颜色之间的明暗也是吸引视觉关注的原因之一."},
{"title":"大气黑金","colors":["#000000","#FF9500","#FFB44A","#FFD191","#FFF1DE"],"desc":"FFF1DE"},
{"title":"枯萎的海","colors":["#FDECD0","#BCD0C5","#91BFBF","#528870","#1D2F3B"],"desc":"很久没有见到能令人刚到舒畅愉快的配色了，这个搭配中除了令人感到轻松的青色，最特别的是加入了粉色这个很少和青色进行组合的搭配，作为冷暖搭配这两种色彩的对比并不十分强烈，反而给人清静自然的感觉。<br/>"},
{"title":"抱枕蓝黑系","colors":["#0E2352","#5579ED","#E8CD56","#9C6628","#0C175C"],"desc":"抱枕蓝黑系<br/>"},
{"title":"体育海报","colors":["#24403C","#C27A59","#8C8C77","#7A3C36"],"desc":"&nbsp;体育海报配色"},
{"title":"春天旅行的体验","colors":["#6C15AB","#67B5A2","#24B300","#C41E04","#C5FF24"],"desc":"根据我个人的理解，旅行是一个从期待到满足的过程，以绿色为主色系"},
{"title":"春天即将来临","colors":["#5A5E59","#54AB11","#73082F","#AD6E07","#D3D923"],"desc":"D3D923"},
{"title":"记忆深处无人知","colors":["#B4145E","#35081D","#214579","#F7C482","#EFECC1"],"desc":"流行和经典常常互相转换，这个搭配属于过于某个时间比较流行，然后过了一段时间的沉寂，现在又重新来到我们面前，高纯度的嫣红和同类色浅绯红形成同类之间的对比，又和不同系的深蓝色产生了极大的对比，形成了流行与经典的搭配。<br/>"},
{"title":"恬静的青春","colors":["#ECF752","#79E8D0","#FFB8B8","#86E65A","#24D197"],"desc":"青春的颜色就是亮丽但不张扬，很安静，给人一种舒适的美的感觉。"},
{"title":"成长至成熟","colors":["#71FF5E","#FFF175","#FF0000","#750202","#000000"],"desc":"第一张图的色彩代表懵懂的小孩步入青春期，第二张图代表的黄色寓意为充满活力的少年，第三张图代表火热的青春，第四张图代表走出青春步入人生之间的磨砺。第五张图代表经历过磨练变的成熟。"},


{"title":"撞色搭配","colors":["#FFFB00","#EEFF6B","#F5FFA6","#006FFF","#FFF9D4"],"desc":"撞色搭配,同色系用色"},
{"title":"春日物语","colors":["#7C8489","#4FB3A4","#FF7073","#F5B977","#FDFC7F"],"desc":"不知不觉中春天已经到来，不由得让人带有一份新的期待，这个配色以娇柔的粉色系作为主色，加以青色和灰色作为搭配显出更加稳重和踏实的感觉，这两种色彩都是粉色的较好搭配，能一扫粉色常见过于柔弱的缺点，也令整个配色的搭配实用性更广。"},
{"title":"环保节日炫彩","colors":["#FF9900","#A6325A","#48A7C2","#206FA1","#B1C914"],"desc":"环保节日炫彩"},
{"title":"影展","colors":["#0e0e0e","#f2f2f2","#fefefe","#204792","#767ec7"],"desc":"适合做摄影展的东西"},
{"title":"大韩物语","colors":["#003CBD","#BD0000","#FFFFFF"],"desc":"FFFFFF"},
{"title":"美国时尚","colors":["#FF4124","#ABABAB","#595957","#050501","#FF0F33"],"desc":"FF0F33"},
{"title":"灰色和彩色","colors":["#241a17","#735b4e","#d8d400"],"desc":"需要灰色和鲜艳颜色搭配"},
{"title":"你并非我的最爱","colors":["#6A2D51","#F85E82","#DA7447","#826653","#255165"],"desc":"华丽和低调是十分矛盾的组合，这里使用高纯度色彩的同时让画面中大面的的灰调色突出出来，虽然整体上和我们常见的低纯度色彩加入高纯度色的手法类似，但这里全部选择暖色调而画面却人含蓄的表现，<br/>"},
{"title":"宝贝的最爱","colors":["#FBFEE9","#FFEEC4","#FB7C85","#5A4446","#8BACA1"],"desc":"这个配色发布的时候已经过了情人节了，但作为万年单身狗的我来说这一些隔着不少距离，如果你需要找到一个关于爱情的搭配却又不想显得过于浓烈，这会是个不错的选择。<br/>"},
{"title":"恋爱的味道","colors":["#FF2465","#FFE3C5","#FFCEA6","#6E6585","#826762"],"desc":"暖色调总是给人生活化的感觉，这个搭配使用了红色这个高纯度色彩和其他几种低纯度色彩，鲜艳的红色在整体的低纯度环境总显得十分鲜艳，而这种色彩也常常被认为是女性的代表色彩，多用于相关的设计领域。"},
{"title":"茶杯蛋糕","colors":["#B04E64","#FFFFFF","#4AA9AA"],"desc":"红色和绿色是一对常见但很难搭配的组合，这里我们使用紫红色代替了通常的红色，形成了一定的变化，相对于红色，少了互补色之间的强烈对比，加上白色，令整体显得较为融合。<br/>"},
{"title":"现代与经典","colors":["#E93C07","#E7C951","#E7E7E7","#151515","#EFA97A"],"desc":"红与黑是一种经典的搭配,常常用于表现一些艺术性较强的主题，但在红黑组合中加入黄色却让画面中多了不少变化，黄色与黑色形成了极大的明暗差，和红色也形成了很强的色相对比，而其他色彩更是作为调剂色而产生作用。"},
{"title":"科技旅行","colors":["#436A3E","#4E8858","#73C09C","#ACBA85","#CDB97A"],"desc":"绿色近来被科技界所青睐，但这个色彩却不是典型的充满科技感的绿色，而是一种高纯度的典型绿色，加上其常见的固定搭配黄绿，形成了一种简单而充满现代感的搭配。"},
{"title":"节日中的孩子","colors":["#37ACCB","#FB9100","#B0C915","#FFFFFF"],"desc":"纯度较高的色彩如果较多使用，会令主题显得较为混乱，这时候使用白色或者黑色进行统一就十分重要了，这个搭配使用青色，橙红，黄绿等偏低龄的色彩，加上大面积白色的统一，就形成了一个十分融洽的童年风格的配色。<br/>"},
{"title":"欢乐嘉年华","colors":["#6DD3CE","#C8E9A0","#F7A278","#A13D63","#351E29"],"desc":"以青春为主题的搭配一般会绚丽明度和纯度都较高的搭配，同时使用全色系色彩进行组合，虽然看起来较为华丽，实际使用还有有一定难度，为此，设计师常常使用色调的统一来让形成画面的整合。"},
{"title":"瓶中爱情","colors":["#745F6E","#718C7D","#68AB82","#A2B98D","#C8CD97"],"desc":"青灰色和绿色本身就是一对在视觉方面较难辨别的色彩，如果单独使用这种色彩的话，形成的也就是一个普通的单色搭配，但使用纯度不高的紫红色，让画面带来较大对比的同时也形成了一种古典而优雅的风格，我们可以在一些时装设计和流行设计中见到这种搭配的使用。</p><p><br/>"},
{"title":"芬兰黎明","colors":["#EEFFC6","#B0FEFB","#BDD9FC","#D5C9F9","#B3ADE9"],"desc":"使用纯度都非常低的色彩，淡紫色，淡蓝色加上淡黄绿，构成了一个素雅而简单的配色，整体没有多少的色彩对比，甚至连明暗的差距也很小，这种弱对比的色彩一般用于其它设计的背景或用于创造出简单风格。"},
{"title":"沙漠美景","colors":["#AE1027","#F5E8C8","#DCD8BB","#A7C5CD","#8B84A3"],"desc":"如果没有浓郁的红色，整个搭配会是一个低纯度的灰色调的搭配，这种配色虽然没有太多出彩的地方，却是文艺类和生活类设计中的常客，而加入高纯度的红色，给整个搭配带来最大的对比，也给画面带来了巨大的冲击。</p><p><br/>"},
{"title":"现代荷尔蒙","colors":["#0E4ACC","#FFDD00","#F5460C","#381F17","#FFFBFA"],"desc":"现代人的生活，不需要太多的颜色和光污染，大面积的饱和色块，就能营造出酷酷的欧美范儿"},
{"title":"夕阳下的桥","colors":["#C9BF8E","#CA836F","#BF6A55","#823E35","#2D0619"],"desc":"浓郁的砖红色在和黑色的搭配中显得十分庄重，给人稳定的同时也带着现代风格的特征。整个配色中色彩较少，可以算是红色的单色搭配，但是黑色和红色之间的明暗对比也给画面带来了更多的变化。"},



]`



const dbdata = JSON.parse(dbdata_str)
module.exports = dbdata