const dbdata = [{
        title: "白色独角兽",
        colors: ['#EFCEE8', '#F3D7B5', '#FDFFDF', '#DAF9CA', '#C7B3E5'],
        desc: "优雅的配色一般都会受到女性的喜爱，这个搭配以淡雅的紫色为主，使用了高明度而纯度很低的色彩-这也是构成类似风格搭配的惯用手段，在色调统一的情况下，加入冷暖等对比，依然能统一画面。"
    },
    {
        title: "海与天的边界",
        colors: ['#4CB4E7', '#FFC09F', '#FFEE93', '#E2DBBE', '#A3A380'],
        desc: "这个配色中海蓝色是毫无疑问的中心色彩，而其他几种辅助色彩相对纯度较低，然而在亮度上却不暗淡，这样整体高明度的组合能令人心情轻松，产生无压力的感觉，接触多了也会产生轻浮的感觉。主要适用于生活风格的设计中。"
    },
    {
        title: "晚霞剪影",
        colors: ['#B85A9A', '#9C2189', '#9E026D', '#B8288A', '#CC2F69'],
        desc: "晚霞出空，猝然心动。"
    },
    {
        title: "神奈川冲浪里",
        colors: ['#0D1740', '#16245C', '#F8F2DC', '#A39F93', '#E9CFAE'],
        desc: "神奈川冲浪里，该画作描绘的是神奈川附近的海域汹涌澎湃的海浪，浪里有三条奋进的船只，英勇的船工们正为了生存而与大自然进行着惊险而激烈的搏斗，表达了人们乘风破浪、勇往直前的大无畏精神。画面色彩统一在蓝色的调子之中，黄色的船只及近似于土黄色的天空和背景，与海浪的蓝色形成鲜明的对比，准确地表达了该画的主题。",
        images: ["cloud://test-5a5603.7465-test-5a5603/snccll.jpg"]
    },
    {
        title: "美好时代的回忆",
        colors: ['#E03636', '#EDD0BE', '#FF534D', '#EDD0BE', '#25C6FC'],
        desc: "橘红色在设计中十分突出，但很少大面积使用，这种色彩用于表现激烈的主题稍显力度不足，没有近亲橙色或红色来的直接，但是在和湖蓝搭配中却很好的发挥了它这种特点，作为暖色大量使用却并不喧宾夺主，很好突出了湖蓝的的特点。"
    },
    {
        title: "午后奶茶",
        colors: ['#EDE387', '#EDEDED', '#3B200C', '#DE8100', '#CCFC62'],
        desc: "悠闲的午休。"
    },
    {
        title: "森林之光",
        colors: ['#82A6F5', '#EAF048', '#9FF048', '#2A5200', '#F6D6FF'],
        desc: "阳光下，蓝天白云，草木茂盛。"
    },
    {
        title: "洋葱花",
        colors: ['#EACF02', '#6C890B', '#ABC327', '#DFB5B7', '#7F1874'],
        desc: "绿色和黄色是一对常见的色彩，这两种色彩组成的黄绿色不但在自然界常见，在人类生活中也十分常用，在这里和这两种色彩进行搭配的是红紫色，这种色彩常用于象征女性，纯度不高是为了让绿色和红色这两种对比较强色彩之间形成平衡。"
    },
    {
        title: "艺术之旅",
        colors: ['#DB9019', '#5ED5D1', '#1A2D27', '#FF6E97', '#F1AAA6'],
        desc: "这个配色类型日本传统搭配中较为鲜艳的风格，但实际其更多的用于现代艺术品的着色中。一些画作，图案设计中较为多见，洋红色和黑色的搭配具有十分明显的现代风格，加上现代感十足的湖蓝，整个搭配使用的色彩纯度极高而明度也很高。"
    }
]


module.exports = dbdata